cf_billing/Documents/бестПлатежноеПоручениеВходящееЭЭЮрЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестПлатежноеПоручениеВходящееЭЭЮрЛица</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыПоПениЭЭ</xr:Item>
				<xr:Item>InformationRegister.бестИсторияОплатыЮрЛиц</xr:Item>
				<xr:Item>AccumulationRegister.бестАвансыЭЭ</xr:Item>
				<xr:Item>AccumulationRegister.бестСуммыОплатЭЭ</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыЭЭ</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыПоАвансовымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыПоМесяцамЭЭ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РООтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестВводНачальныхОстатковЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НеЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестПлатежноеПоручениеВходящееЭЭЮрЛица/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("IDСтрокиОплаты") И ЗначениеЗаполнено(Параметры.IDСтрокиОплаты) Тогда
		Строки = Объект.Оплата.НайтиСтроки(Новый Структура("IDСтроки", Параметры.IDСтрокиОплаты));
		Если Строки.Количество() > 0 Тогда
			Элементы.Оплата.ТекущаяСтрока  = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ПериодНачисления)
		И ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.Район) Тогда
		Объект.ПериодНачисления = 
			Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()), 
																						Объект.Организация, Объект.Район);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестЗаключениеДоговоровСЮридическимиЛицами(ЭтотОбъект);
	
	ЗаполнитьЗадолженность();
	НастроитьВидимостьЭлементов();
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределитьНаличиеНазначения();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОпределитьНаличиеНазначения();
	ЗаполнитьЗадолженность();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 		= Ложь;
	Диалог 						= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр 	= "*.TXT";
	Если Диалог.Выбрать() тогда
		Объект.ФайлДляЧтения 	= Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПоступленияПриИзменении(Элемент)
	НастроитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	Если не ЗначениеЗаполнено(Объект.ФайлДляЧтения) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите файл для чтения",,"ФайлДляЧтения","ФайлДляЧтения");
		Возврат;
	КонецЕсли;   	
	
	ДвоичныеДанные  	= Новый ДвоичныеДанные(Объект.ФайлДляЧтения); 	
	АдресХранилища  	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
	
	ЗагрузитьФайлСервер(АдресХранилища);
	ОпределитьНаличиеНазначения();
	ЗаполнитьЗадолженность();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОплату(Команда)
	Для каждого стр из Объект.НеЗагруженныеДанные Цикл
		Если ЗначениеЗаполнено(стр.Контрагент) И стр.Организация = ПредопределенноеЗначение("Справочник.Организации.НашаОрганизация") Тогда
			НовСтр = Объект.Оплата.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,стр);
			Объект.НеЗагруженныеДанные.Удалить(стр.НомерСтроки - 1);
		КонецЕсли;
	КонецЦикла;
	ОпределитьНаличиеНазначения();
	ЗаполнитьЗадолженность();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Заполненные строки перенесены в ТЧ Оплата");
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_Оплата

&НаКлиенте
Процедура ОплатаПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ДокументыНачисления,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ДокументыНачисления");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_НеЗагруженныеДанные

&НаКлиенте
Процедура НеЗагруженныеДанныеПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.НеЗагруженныеДанные.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ДокументыНачисленияНезагруженныеДанные,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура НеЗагруженныеДанныеПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.НеЗагруженныеДанные.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ДокументыНачисления");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ДокументыНачисления

&НаКлиенте
Процедура ДокументыНачисленияПриИзменении(Элемент)
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 							= Элементы.ДокументыНачисления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленияДокументНачисленияПриИзменении(Элемент)
	ТекСтрока = Элементы.ДокументыНачисления.ТекущиеДанные;
	ДокументНачисления = ТекСтрока.ДокументНачисления; 
	ТекСтрока.ПериодНачисления = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНачисления, "ПериодНачисления");
	мДокументНачисления = Новый Массив;
	мДокументНачисления.Добавить(ДокументНачисления);
	СоответствиеЗадолженности = ПолучитьЗадолженностьПоПД(Объект.Организация, Объект.Район, мДокументНачисления, Объект.Дата);
	Задолженность = СоответствиеЗадолженности.Получить(ДокументНачисления);
	ТекСтрока.Задолженность = ?(Задолженность = Неопределено, 0, Задолженность);
	ТекСтрока.СуммаОплаты = 0;
	СуммыОплат = ПроверитьСуммыОплат(ТекСтрока.IDСтроки);
	МаксСуммаОплаты = СуммыОплат.СуммаОплаты - СуммыОплат.СуммаОплатыНазначений;
	ТекСтрока.СуммаОплаты = Мин(МаксСуммаОплаты, ТекСтрока.Задолженность);
	ПриИзмененииСуммыПроверка(ТекСтрока);
	УстановитьНаличиеНазначения(ТекСтрока.IDСтроки, ЗначениеЗаполнено(ДокументНачисления));
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленияДокументНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.ДокументыНачисления.ТекущиеДанные;
	ОткрытьФормуВыбораПДСОтборами(Элемент, ТекСтрока, Элементы.Оплата.ТекущиеДанные.Договор);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленияПослеУдаления(Элемент)
	ОпределитьНаличиеНазначения();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленияПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ДокументыНачисления.ТекущиеДанные;
	УстановитьНаличиеНазначения(ТекДанные.IDСтроки, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленияСуммаОплатыПриИзменении(Элемент)
	ТекСтрока = Элементы.ДокументыНачисления.ТекущиеДанные;
	ПриИзмененииСуммыПроверка(ТекСтрока);	
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ДокументыНачисленияНезагруженныеДанные

&НаКлиенте
Процедура ДокументыНачисленияНезагруженныеДанныеДокументНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.ДокументыНачисленияНезагруженныеДанные.ТекущиеДанные;
	ОткрытьФормуВыбораПДСОтборами(Элемент, ТекСтрока, Элементы.НеЗагруженныеДанные.ТекущиеДанные.Договор);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленияНезагруженныеДанныеДокументНачисленияПриИзменении(Элемент)
	ТекСтрока = Элементы.ДокументыНачисленияНезагруженныеДанные.ТекущиеДанные;
	ДокументНачисления = ТекСтрока.ДокументНачисления;
	ТекСтрока.ПериодНачисления = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНачисления, "ПериодНачисления");
	МаксСуммаОплаты = ПросуммироватьОплату(ТекСтрока.IDСтроки, "НеЗагруженныеДанные");
	мДокументНачисления = Новый Массив;
	мДокументНачисления.Добавить(ДокументНачисления);
	СоответствиеЗадолженности = ПолучитьЗадолженностьПоПД(Объект.Организация, Объект.Район, мДокументНачисления, Объект.Дата);
	Задолженность = СоответствиеЗадолженности.Получить(ДокументНачисления);
	ТекСтрока.Задолженность = Задолженность;
	ТекСтрока.СуммаОплаты = Мин(МаксСуммаОплаты, ТекСтрока.Задолженность);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленияНезагруженныеДанныеПриИзменении(Элемент)
	ТекДанные = Элементы.НеЗагруженныеДанные.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 							= Элементы.ДокументыНачисленияНезагруженныеДанные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура НеЗагруженныеДанныеДоговорПриИзменении(Элемент)
	ТекДанные = Элементы.НеЗагруженныеДанные.ТекущиеДанные;
	ТекДанные.Контрагент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Договор, "Контрагент");
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлСервер(АдресХранилища)
	  бестИнтеграции.ЗагрузитьФайлОплаты(АдресХранилища, Объект);
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РООтправитель", "Видимость", Объект.ИсточникПоступления = Справочники.энргИсточникиПоступления.Авизо);
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьНаличиеНазначения()
	Для каждого СтрокаНазначение из Объект.ДокументыНачисления Цикл
		Если ЗначениеЗаполнено(СтрокаНазначение.ДокументНачисления) Тогда
			УстановитьНаличиеНазначения(СтрокаНазначение.IDСтроки, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаОплата из Объект.Оплата Цикл
		СуммыОплат = ПроверитьСуммыОплат(СтрокаОплата.IDСтроки);
		СтрокаОплата.СуммаНеРаспределена = (СуммыОплат.СуммаОплатыНазначений <> 0 И
											СуммыОплат.СуммаОплатыНазначений < СуммыОплат.СуммаОплаты);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаличиеНазначения(IDСтроки, ДокументНачисленияПрисутствует)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтроки);
	НайденныеСтроки = Объект.Оплата.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаОплата Из НайденныеСтроки Цикл
		СтрокаОплата.ДокументНачисленияПрисутствует = ДокументНачисленияПрисутствует;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПросуммироватьОплату(IDСтроки, ТЧ)
	Сумма = 0;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтроки);
	НайденныеСтроки = Объект[ТЧ].НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаОплата Из НайденныеСтроки Цикл
		Сумма = Сумма + СтрокаОплата.СуммаОплаты;
	КонецЦикла;
	Возврат Сумма;
КонецФункции

&НаКлиенте
Функция ПроверитьСуммыОплат(IDСтроки)
	СуммаОплаты = ПросуммироватьОплату(IDСтроки, "Оплата");
	СуммаОплатыНазначений = ПросуммироватьОплату(IDСтроки, "ДокументыНачисления");
	Возврат Новый Структура("СуммаОплаты, СуммаОплатыНазначений", СуммаОплаты, СуммаОплатыНазначений);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗадолженностьПоПД(Организация, Район, мДокументНачисления, Период)
	  Возврат бестВзаиморасчетыЮрЛицаСервер.ПолучитьЗадолженностьПоПД(Организация, Район, мДокументНачисления, Период);
КонецФункции	

&НаСервере
Процедура ЗаполнитьЗадолженность()
	СоответствиеЗадолженности = ПолучитьЗадолженностьПоПД(Объект.Организация, Объект.Район, 
		Объект.ДокументыНачисления.Выгрузить().ВыгрузитьКолонку("ДокументНачисления"), Объект.Дата);
	Для каждого Строка из Объект.ДокументыНачисления Цикл
		Строка.Задолженность = СоответствиеЗадолженности.Получить(Строка.ДокументНачисления);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПДДляОтбора(ДокументНачисления)
	мПД = Новый Массив;
	Для каждого СтрокаОплата из Объект.Оплата Цикл
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", СтрокаОплата.IDСтроки);
	НайденныеСтроки = Объект.ДокументыНачисления.НайтиСтроки(ПараметрыОтбора);
	Для каждого Строка из НайденныеСтроки Цикл
		Если ЗначениеЗаполнено(Строка.ДокументНачисления) 
				И Строка.ДокументНачисления <> ДокументНачисления
				И Строка.Задолженность <= Строка.СуммаОплаты Тогда
			мПД.Добавить(Строка.ДокументНачисления);
		КонецЕсли;
	КонецЦикла;
	КонецЦикла;

	Возврат мПД;
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораПДСОтборами(Элемент, ТекСтрока, ТЧОтбор)
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;

    ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	
	мПД = Новый Массив;
	мПД.Добавить(ТекСтрока.ДокументНачисления);
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = ПолучитьПДДляОтбора(ТекСтрока.ДокументНачисления);
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = ТЧОтбор;
	
	Если ЗначениеЗаполнено(ТекСтрока.ПериодНачисления) Тогда
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПериодНачисления");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ПравоеЗначение = ТекСтрока.ПериодНачисления;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Период", Объект.Дата);
	
	ОткрытьФорму("Документ.бестПлатежныйДокумент.ФормаВыбора", ПараметрыФормы, Элемент);
				
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммыПроверка(ТекСтрока)
	СуммыОплат = ПроверитьСуммыОплат(ТекСтрока.IDСтроки);
	Если СуммыОплат.СуммаОплатыНазначений > СуммыОплат.СуммаОплаты Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Распределенная сумма больше суммы оплаты.");
		ТекСтрока.СуммаОплаты = 0;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("IDСтроки", ТекСтрока.IDСтроки);
		НайденныеСтроки = Объект.Оплата.НайтиСтроки(ПараметрыОтбора);
		Для каждого СтрокаОплата Из НайденныеСтроки Цикл
			СтрокаОплата.СуммаНеРаспределена = СуммыОплат.СуммаОплатыНазначений <> 0
												И СуммыОплат.СуммаОплатыНазначений < СуммыОплат.СуммаОплаты;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
